<!DOCTYPE html>
<html>
<head>
	<meta charset="utf-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<title>Lesson1</title>
	
</head>
<body>
<div class="container">
	<div class="row">

		<h1>Введение</h1>
		<p>
			PHP - самый популярный язык для веб-разработки. Работу на нем можно найти практически везде, и именно в PHP чаще приняти набирать начинающих разработчиков. Профессия PHP-программист курса дает необходимые знания и навыки для трудоустройства, и именно с этого курса начинается погружение в язык.
		</p>
		<p>
			Курс состоит из двух частей. В первой части даются самые основы программирования на PHP и попутно объяняются такие вещи, как представление 	данных в памяти, стандарты именования, кодирование строк, тестирование, побочные эффекты, представление времени в компьютере и многое другое.
		</p>
		<p>
			Изучение основ программирования с самого нуля требует особого способа организации учебного материала. На первом этапе необходимо первычное привыкание к языковым конструкциям и закрепление их на практике.
		</p>
		<p>
		Цели данного курса:
			<ul>
				<li>
					Познакомиться с основными конструкциями языка;
				</li>
				<li>
					Разбираться со структурой практических заданий
				</li>
				<li>
					Познакомиться с отладкой и научиться эффективно ее выполнять
				</li>
				<li>
					Изучить механизмы, позволяющие работать с многофайловыми проектами
				</li>
			</ul>
		</p>
		<p>
			Каждый урок курса заканчивается упражнением, а после курса - множество дополнительных заданий, которые желательно выполнить до перехода на следующий курс. Эти задания охвытывают сразу весь материал и помогают наработать необходимую практику для дальнейшего продвижения по профессии. 
		</p>
		<a href="./include/teory/lesson2.php">Далее</a>
	</div>
</div>
</body>
</html>