<!DOCTYPE html>
<html>
<head>
	<meta charset="utf-8">
	<meta name="viewport" content="width=device-width, initial-scale=1">
	<link rel="stylesheet" type="text/css" href="../../css/style.css">
	<title>Стандартная библиотека</title>
</head>
<body>
<div class="container">
	<div class="row">
		<h1>
			Стандартная библиотека
		</h1>
		<p>
			PHP, как и любой другой язык, поставляется с набором полезных функций. Все вместе они осоставляют так называемую <b>стандартную библиотеку</b>. В нее обычно входят тысячи функций, которые невозможно выучить - этого и не нужно делать. Подразумевается, что любой программист знает где искать документвцию по ним и применрно представляет себе, чего хочет достичь. А дальше - дело техники. Программировать без интернета крайне сложно. <br>
			Для новечков эта информация часто выглядит так: "Сходи туда, не знаю куда, принеси то, не знаю что". То есть непонятно, как узнавать про эти функции, когда ты ничего не знаешь вообще. Как ни странно, не существует способа раз и навсегда познать все, что нужно познать. Любой разработчик в процессе своего профессионального врзрасления знакомится со все более интересными функциями, решающими его задачи более элегантно и таким образом пополняет свой арсенал.<br>
			Некоторые советы как узнавать о некоторых функциях:
			<ul>
				<li>
					Всегда четко отслеживать, с чем сейчас работаете (какой тип данных). Почти всегда можно найти необходимую информацию в соответствующем разделе документации, например, для работы со строками нужно изучать строковы функции;
				</li>
				<li>
					Периодически открывайте раздел со стандартными функциями по изучаемой тематике и просто пробегайтесь по ним, изучая стругтуры и способы использования;
				</li>
				<li>
					Чаще читайте чужой код, особенно код библиотек, который используете. Он весь доступен на GitHub.
				</li>
			</ul>
		</p>
		<p>
			Еще одна особенность функции PHP из стандартной библиотеки в том, что они <i>доступны глобально</i>. Другими словами, можно вызвать их в любом месте программы (не работает с функциями, которые написаны самостоятельно). Большинство функций стандартной библиотеки сосредоточено вокруг какой-то функциональности или какого-то типа данных. Например, есть блок функций по обработке строк или работе с числами. По некоорым из них пройдем в процессе обучения.
		</p>
	</div>
</div>
<a href="./lesson18.php">Далее</a>
</body>
</html>